## 1. –°–æ–∑–¥–∞–Ω–∏–µ —Ç–∞–±–ª–∏—Ü (CREATE TABLE)

### üß© –°–æ–∑–¥–∞–Ω–∏–µ —Ç–∞–±–ª–∏—Ü (CREATE TABLE)

**–ü–æ—Å—Ç–∞–Ω–æ–≤–∫–∞ –ø—Ä–æ–±–ª–µ–º—ã:**  
–õ—é–±–∞—è –±–∞–∑–∞ –¥–∞–Ω–Ω—ã—Ö –Ω–∞—á–∏–Ω–∞–µ—Ç—Å—è —Å —Ç–∞–±–ª–∏—Ü. –û–Ω–∏ –æ–ø—Ä–µ–¥–µ–ª—è—é—Ç —Å—Ç—Ä—É–∫—Ç—É—Ä—É —Ö—Ä–∞–Ω–µ–Ω–∏—è: –∫–∞–∫–∏–µ –±—É–¥—É—Ç —Å—Ç–æ–ª–±—Ü—ã, –∫–∞–∫–∏–µ —Ç–∏–ø—ã –¥–∞–Ω–Ω—ã—Ö, –∫–∞–∫–∏–µ –æ–≥—Ä–∞–Ω–∏—á–µ–Ω–∏—è. –ë–µ–∑ —Ç–∞–±–ª–∏—Ü –Ω–µ–≤–æ–∑–º–æ–∂–Ω–æ —Å–æ—Ö—Ä–∞–Ω–∏—Ç—å –Ω–∏ –æ–¥–Ω–æ–π —Å—Ç—Ä–æ–∫–∏ –¥–∞–Ω–Ω—ã—Ö.

**–ö—Ä–∞—Ç–∫–∞—è —Ç–µ–æ—Ä–∏—è:**  
–ö–æ–º–∞–Ω–¥–∞ `CREATE TABLE` –∏—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è –¥–ª—è —Å–æ–∑–¥–∞–Ω–∏—è –Ω–æ–≤–æ–π —Ç–∞–±–ª–∏—Ü—ã –≤ –±–∞–∑–µ. –£–∫–∞–∑—ã–≤–∞–µ—Ç—Å—è –∏–º—è —Ç–∞–±–ª–∏—Ü—ã –∏ —Å–ø–∏—Å–æ–∫ —Å—Ç–æ–ª–±—Ü–æ–≤ —Å –∏—Ö —Ç–∏–ø–∞–º–∏ –¥–∞–Ω–Ω—ã—Ö.

**–ü—Ä–∏–º–µ—Ä —Å–∏–Ω—Ç–∞–∫—Å–∏—Å–∞:**
```sql
CREATE TABLE books (
    id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    author TEXT,
    year INTEGER
);
```
–¢–∏–ø—ã –¥–∞–Ω–Ω—ã—Ö –≤ SQLite:
- `INTEGER` ‚Äî —Ü–µ–ª—ã–µ —á–∏—Å–ª–∞
- `REAL` ‚Äî —á–∏—Å–ª–∞ —Å –ø–ª–∞–≤–∞—é—â–µ–π —Ç–æ—á–∫–æ–π
- `TEXT` ‚Äî —Å—Ç—Ä–æ–∫–∏
- `BLOB` ‚Äî –±–∏–Ω–∞—Ä–Ω—ã–µ –¥–∞–Ω–Ω—ã–µ
- `NULL` ‚Äî –æ—Ç—Å—É—Ç—Å—Ç–≤–∏–µ –∑–Ω–∞—á–µ–Ω–∏—è

**–ü—Ä–∏–º–µ—Ä:**

In [ ]:
# –†–∞–±–æ—Ç–∞–µ–º —Å SQLite3
import sqlite3

# –°–æ–∑–¥–∞—ë–º –≤—Ä–µ–º–µ–Ω–Ω—É—é –ë–î –≤ –ø–∞–º—è—Ç–∏
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# –°–æ–∑–¥–∞—ë–º —Ç–∞–±–ª–∏—Ü—É
cursor.execute('''
CREATE TABLE books (
    id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    author TEXT,
    year INTEGER
);
''')

# –î–æ–±–∞–≤–∏–º –¥–∞–Ω–Ω—ã–µ
cursor.execute("INSERT INTO books (title, author, year) VALUES (?, ?, ?)",
               ("1984", "George Orwell", 1949))
cursor.execute("INSERT INTO books (title, author, year) VALUES (?, ?, ?)",
               ("Brave New World", "Aldous Huxley", 1932))
conn.commit()

# –ü–æ—Å–º–æ—Ç—Ä–∏–º —Ç–∞–±–ª–∏—Ü—É
cursor.execute("SELECT * FROM books")
for row in cursor.fetchall():
    print(row)